Repository: fivebyfive-se/klr
Catalog: lib/l10n/app_*.arb
Languages: sv

# btn_cancel
source: Cancel
sv: Avbryt

# btn_delete
source: Delete
sv: Radera

# btn_close
source: Close
sv: Stäng

# btn_save
source: Save palette
sv: Spara färgschema

# fabMenu_close
source: Close
sv: Avbryt

# fabMenu_closeDesc
source: Exit this menu
sv: Stäng denna meny

# start_title
source: Dashboard
sv: Start

# start_fabMenu_title
source: Actions
sv: Hantera sparad data

# start_fabMenu_clear
source: Clear
sv: Rensa

# start_fabMenu_clearDesc
source: Remove all palettes
sv: Ta bort alla färgscheman

# start_fabMenu_clearAll
source: Clear everything
sv: Rensa allt

# start_fabMenu_clearAllDesc
source: Remove ALL saved data
sv: Ta bort ALL sparad data

# start_palettes_title
source: Palettes
sv: Färgscheman

# start_palettes_subtitle
source: Your saved color schemes
sv: Dina sparade färgscheman

# start_palettes_item
source: {count, plural, zero{No colors} one{One color} other{{count} colors}}
sv: {count, plural, zero{Inga färger} one{en färg} other{{count} färger}}

# start_noPalettes_intro
source: You don't have any palettes yet. Create a palette
sv: Du har inga färgscheman sparade. Skapa ett schema

# start_noPalettes_tpl
source: based on the default KLR template
sv: utifrån KLRs grundmall

# start_noPalettes_gen
source: using generator functions
sv: med hjälp av generator funktioner

# start_noPalettes_gen_suffix
source: , or
sv: eller

# start_noPalettes_img
source: by extracting colors from an image
sv: genom att ta färger från en bild

# colorWheel_mode
source: Mode
sv: Läge

# palette_title
source: Palette
sv: Färgschema

# contrast_title
source: Contrast
sv: Kontrast

# contrast_background
source: Background color
sv: Bakgrundsfärg

# contrast_largeText
source: Large text
sv: Stor text

# contrast_smallText
source: Small text
sv: Liten text

# contrast_helpText
source: WCAG requires a contrast of at least 4.5 between text and background.
sv: WCAG kräver en kontrastratio på 4.5 mellan text och bakgrund.

# stats_title
source: Compare colors
sv: Jämför färger

# stats_colorblindness
source: Sim. color blindness
sv: Sim. färgblindhet

# css_useVariables
source: Use CSS variables
sv: Använd CSS-variabler

# css_useHex
source: Use hexadecimal colors
sv: Hexadecimala färger

# color_name
source: Name
sv: Namn

# color_suggestName
source: Suggest name
sv: Föreslagna namn

# color_harmony
source: Harmony
sv: Färgharmoni

# color_edit_wheel
source: Color wheel
sv: Färghjul

# color_channels_hsl
source: Channels (HSL)
sv: Färgkanaler (HSL)

# color_channels_rgb
source: Channels (RGB)
sv: Färgkanaler (RGB)

# color_channels_ryb
source: Channels (RYB)
sv: Färgkanaler (RYB)

# image_image
source: image
sv: bild

# image_colors
source: Colors
sv: Färger

# image_loadImage
source: Load image
sv: Ladda bild

# generator_paletteName
source: Generated
sv: Genererad

# generator_title
source: Generate palette
sv: Generera färgschema

# generator_colors
source: Colors
sv: Färger

# start_createPalette_title
source: New palette...
sv: Nytt färgschema

# start_createPalette_subtitle
source: Create a new palette using a generator or from an image
sv: Skapa ett nytt färgschema, med utgångspunkt från generatorer eller en bild

# start_createPalette_tpl_title
source: New from template
sv: Ny från mall

# start_createPalette_tpl_subtitle
source: Use the default KLR palette template
sv: Använd KLRs grundmall för att skapa färgschema

# start_createPalette_gen_title
source: New from generator
sv: Ny utifrån generator

# start_createPalette_gen_subtitle
source: Use generator functions to build a new palette
sv: Använd generatorfunktioner för att generera ett färgschema

# start_createPalette_img_title
source: New from image
sv: Ny från bild

# start_createPalette_img_subtitle
source: Use an image to generate a new palette
sv: Använd en bild som källa till ett färgschema

# palette_subtitle
source: {count, plural, zero{No colors} one{One color} other{{count} colors}}
sv: Dina sparade färgscheman

# info_title
source: Help
sv: Hjälp

# info_subtitle
source: Tips & tricks
sv: Tips och tricks

# info_palettes_title
source: Palettes
sv: Färgscheman

# info_palettes_create_intro
source: There are three ways of creating palettes in KLR:
sv: Det finns tre sätt att skapa färgscheman i KLR:

# info_palettes_create_tpl
source: Using the default KLR template, which will randomly generate a color, and then four more colors, each with its hue rotated 60 degrees clockwise from the previous color.
sv: Med hjälp av KLRs grundtema, som slumpgenererar en färg och sen skapar ytterligare fyra färger, där varje färgs ton är roterad 40 grader medurs från föregående.

# info_palettes_create_gen
source: Using generator functions. Here, you define start values for each of the hue, saturation, and lightness channels, which can each be modified in a customizable number of steps by either a fixed amount or using a tweening curve.
sv: Med hjälp av generatorfunktioner, där du bestämmer start och slutvärden för färgkanaler och kan använda kvadratiska kurvor för att bestämma hur kanalernas värden ska ändras mellan varje färg.

# info_palettes_create_img
source: Using an image, from which KLR will extract five representative colors.
sv: Med hjälp av en bild: välj en bild, och KLR hämtar fem färger från den bilden som du kan spara som ett nytt färgschema

# info_colors_title
source: Colors
sv: Färger

# info_colors_intro
source: There are two types of colors in KLR: palette colors and generated colors. When editing a palette the former are shown as full-colored boxes, while the latter are shown with bordered boxes, where the border color is that of the generated color's source color.
sv: Det finns två slags färger i KLRs färgscheman:

# info_colors_palette_title
source: Palette colors
sv: Fasta färger

# info_colors_palette
source: Tapping a palette color opens the color editor, which consists of two sections: the first is the meta data section, where you can edit the name of the color, either manually or (by pressing the 'suggested names' button) selecting from a list of suggested names. In the meta data section, you can also use color harmonies to generate colors based upon this color. The other section in the color editor is the color-editing section, where there are four different editors for changing the color itself.
sv: Dessa kan ändras genom att peka på färgen i listan. I redigeringsfönstret som öppnas kan du, förutom att ändra färgen i sig, också ändra namn på färgen (eller använda ett automatiskt genererat namnförslag), lägga till en harmoni -- dvs låta KLR automatiskt generera ett antal färger med utgångspunkt från denna samt från olika färgharmoniska förhållanden

# info_colors_generated_title
source: Generated colors
sv: Genererade färger

# info_colors_generated
source: Generated colors can be promoted to palette colors by selecting them in the color list (by long-pressing a color to enter selection mode) and pressing the arrow icon in the action list above the color list.
sv: Dessa är ett resultat av att lägga till harmonier till fasta färger. De kan identifieras genom att de är något minder i listan. De kan omvandlas till fast färger genom att markera dem i listan (med långtryck på en färg för att start selektion) och sedan trycka på uppåtpilen ovanför listan.

# info_colors_helpers_intro
source: Below the color list, there are three helper sections:
sv: I färgschemavyn finns också tre hjälpfunktioner:

# info_colors_helpers_contrast
source: Contrast: where you can check the contrast ratios among the colors
sv: Kontrastvyn, där du kan se kontrastförhållandet mellan varje färg och de andra. KLR ger också förslag på en ändring av de färger som inte når upp till WCAGs krav på kontrast -- här har KLR försökt att automatiskt göra färgen mörkare/ljusare.

# info_colors_helpers_compare
source: Compare: where you compare the colors by channel (hue, saturation, lightness) or luma (perceived lightness), and also view how the colors appear for people with various kinds of color blindness
sv: Diagramvyn, där du kan jämföra färgerna utifrån deras kanaler (ton, mättnad, ljus, luma), samt också simulera hur färgerna ser ut och förhåller sig till varandra för personer med diverse typer av färgblindhet

# info_colors_helpers_css
source: CSS: where you can view generated CSS for the palette
sv: CSS-vyn, där du kan se färgerna som CSS-kod
